# Create Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarSystemSpanSymbol..::..Create Method
RebarSystemSpanSymbol Class See Also
---
Creates a new instance of RebarSystemSpanSymbol in the project.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static RebarSystemSpanSymbol Create(
	Document document,
	ElementId viewId,
	LinkElementId hostId,
	XYZ point,
	ElementId symbolId
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	document As Document, _
	viewId As ElementId, _
	hostId As LinkElementId, _
	point As XYZ, _
	symbolId As ElementId _
) As RebarSystemSpanSymbol
```

Visual C++
---
```text
public:
static RebarSystemSpanSymbol^ Create(
	Document^ document,
	ElementId^ viewId,
	LinkElementId^ hostId,
	XYZ^ point,
	ElementId^ symbolId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
viewId
    Type: Autodesk.Revit.DB..::..ElementId The id of the view in which the symbol should appear.
hostId
    Type: Autodesk.Revit.DB..::..LinkElementId The ElementId of AreaReinforcement (either in the document, or linked from another document).
point
    Type: Autodesk.Revit.DB..::..XYZ The span symbol's head position.
symbolId
    Type: Autodesk.Revit.DB..::..ElementId The id of the family symbol of this symbol.
# ### Return Value
A reference to newly created span symbol.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | hostId should refer to a AreaReinforcement element. -or- viewId does not refer to a valid view type for FabricReinSpanSymbol - only floor plan, reflected ceiling plans and elevations are permitted. -or- symbolId should refer to a FamilySymbol of category OST_FabricReinSpanSymbol. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarSystemSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace